IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_FSI0_RX1_CONTROLSS_FSI0_RX1.xml
	<register id="CONTROLSS_FSI0_RX1_RX_BUF_PTR_STS" acronym="CONTROLSS_FSI0_RX1_RX_BUF_PTR_STS" offset="0x1E" width="16" description="">
		<bitfield id="CURR_WORD_CNT" width="5" begin="12" end="8" resetval="0x0" description="Words Available in the Receive Buffer This bitfield indicates the number of valid data words present in the receive buffer that have not been read by the application software. This bitfield is only valid when there is no active transfer.  Note: This value will not be valid if there has been a buffer overrun or underrun condition." range="12 - 8" rwaccess="RO"/> 
		<bitfield id="CURR_BUF_PTR" width="4" begin="3" end="0" resetval="0x0" description="Current Buffer Pointer Index This bitfield will show the current index of the buffer pointer. This value is only valid when there is no active transmission." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI0_RX1_RX_FRAME_WD_CTRL" acronym="CONTROLSS_FSI0_RX1_RX_FRAME_WD_CTRL" offset="0x20" width="16" description="">
		<bitfield id="FRAME_WD_EN" width="1" begin="1" end="1" resetval="0x0" description="Frame Watchdog Counter Enable bit This bit will enable or disable the frame watchdog counter. The counter (RX_FRAME_WD_CNT) will begin counting from 0 when a valid start-of-frame pattern is received. When the reference value (RX_FRAME_WD_REF) is reached, it will generate a frame watchdog timeout event (RX_EVT_STS.FRAME_WD_TO) and the counter value will reset to 0 and continue counting on the next valid start-of-frame.  0h (R/W) = The frame watchdog counter is disabled and not running. 1h (R/W) = The frame watchdog counter logic is enabled and running." range="1" rwaccess="RW"/> 
		<bitfield id="FRAME_WD_CNT_RST" width="1" begin="0" end="0" resetval="0x0" description="Frame Watchdog Counter Reset bit This bit will reset the frame watchdog counter to 0. Writing a 1 to this bit will reset the frame watchdog counter to 0. The counter will stay in reset as long as this bit is set to 1. This bit needs to be cleared to 0 to use the counter  0h (R/W) = Clear the FRAME_WD_CNT_RST. 1h (W) = The frame watchdog counter will be reset to 0." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_RX1_RX_FRAME_WD_REF" acronym="CONTROLSS_FSI0_RX1_RX_FRAME_WD_REF" offset="0x24" width="32" description="">
		<bitfield id="FRAME_WD_REF" width="32" begin="31" end="0" resetval="0x0" description="Frame Watchdog Counter Reference Value This is the 32-bit reference value for the frame watchdog timeout counter. The counter will count up starting from 0 at a valid start-of-frame pattern and continue counting until this value is reached." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_RX1_RX_FRAME_WD_CNT" acronym="CONTROLSS_FSI0_RX1_RX_FRAME_WD_CNT" offset="0x28" width="32" description="">
		<bitfield id="FRAME_WD_CNT" width="32" begin="31" end="0" resetval="0x0" description="Frame Watchdog Counter Value This is the 32-bit read-only register which shows the current value of the frame watchdog counter. This counter is reset to 0 in a variety of ways: A write to FRME_WD_CNT_RST, a match with FRAME_WD_REF, or the reception of a successful data frame." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI0_RX1_RX_PING_WD_CTRL" acronym="CONTROLSS_FSI0_RX1_RX_PING_WD_CTRL" offset="0x2C" width="16" description="">
		<bitfield id="PING_WD_EN" width="1" begin="1" end="1" resetval="0x0" description="Ping Watchdog Counter Enable bit This bit will enable or disable the ping watchdog counter. The counter (RX_PING_WD_CNT) will begin counting from 0 when it is enabled. When the reference value (RX_PING_WD_REF) is reached, it will generate a ping watchdog timeout event (RX_EVT_STS.PING_WD_TO) and the counter value will reset to 0, and resume counting  0h (R/W) = The ping watchdog counter is disabled and not running. 1h (R/W) = The ping watchdog counter logic is enabled and running." range="1" rwaccess="RW"/> 
		<bitfield id="PING_WD_RST" width="1" begin="0" end="0" resetval="0x0" description="Ping Watchdog Counter Reset bit This bit will reset the ping watchdog counter to 0. Writing a 1 to this bit will reset the ping watchdog counter to 0. The counter will stay in reset as long as this bit is set to 1. This bit needs to be cleared to 0 to use the counter  0h (R/W) = Clear the PING_WD_RST. 1h (W) = The ping watchdog counter will be reset to 0." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_RX1_RX_PING_TAG" acronym="CONTROLSS_FSI0_RX1_RX_PING_TAG" offset="0x2E" width="16" description="">
		<bitfield id="PING_TAG" width="4" begin="4" end="1" resetval="0x0" description="Received Ping Frame Tag This field contains the 4-bit frame tag from the last successfully received ping frame. This is intentionally shifted into bits 4:1 so that the register can be used as a 32-bit address index based on the received tag." range="4 - 1" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="1" begin="0" end="0" resetval="0x0" description="Zero bit This bit will always read  as 0. This is intentionally provided to create a 32-bit offset if required. Using the PING_TAG  and ZERO bits of this register (bits 4:0), application software can directly index into an array of 32-bit data." range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI0_RX1_RX_PING_WD_REF" acronym="CONTROLSS_FSI0_RX1_RX_PING_WD_REF" offset="0x30" width="32" description="">
		<bitfield id="PING_WD_REF" width="32" begin="31" end="0" resetval="0x0" description="Ping Watchdog Counter Reference Value This is the 32-bit reference value for the ping watchdog timeout counter. The counter will count up starting from 0 and continue counting until this value is reached." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_RX1_RX_PING_WD_CNT" acronym="CONTROLSS_FSI0_RX1_RX_PING_WD_CNT" offset="0x34" width="32" description="">
		<bitfield id="PING_WD_CNT" width="32" begin="31" end="0" resetval="0x0" description="Ping Watchdog Counter Value This is the 32-bit read-only register which shows the current value of the ping watchdog counter. This counter is reset to 0 in a variety of ways: A write to PING_WD_RST, a match with PING_WD_REF, or the reception of a ping frame." range="31 - 0" rwaccess="RO"/>
	</register>
